In [1]:
import pandas as pd

In [9]:
orders = pd.read_table('http://bit.ly/chiporders')

C:\Users\Sharjeel Ahmed\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

<h4>
    
    seperation 
    header removal 
    and col name assignment
    </h4>

In [18]:
user_col =['user_id', 'age', 'gender', 'occupation', 'zip_code']
user = pd.read_table('http://bit.ly/movieusers', sep = '|', header=None, names=user_col)

C:\Users\Sharjeel Ahmed\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

In [19]:
user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [25]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [26]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [28]:
type(ufo['City'])

pandas.core.series.Series

In [30]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [35]:
ufo['Location'] = ufo.City + ', ' + ufo.State #crating new series

In [36]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [43]:
ufo['Shape Reported'] #to use space series

0         TRIANGLE
1            OTHER
2             OVAL
3             DISK
4            LIGHT
5             DISK
6           CIRCLE
7             DISK
8            CIGAR
9         CYLINDER
10           LIGHT
11        FIREBALL
12          SPHERE
13            OVAL
14            DISK
15          CIRCLE
16             NaN
17             NaN
18       RECTANGLE
19           OTHER
20            DISK
21             NaN
22           LIGHT
23       RECTANGLE
24            DISK
25           CIGAR
26            DISK
27            DISK
28            DISK
29            DISK
           ...
18211      DIAMOND
18212         DISK
18213     FIREBALL
18214    FORMATION
18215        OTHER
18216        LIGHT
18217     TRIANGLE
18218      DIAMOND
18219      CHEVRON
18220         DISK
18221         DISK
18222        OTHER
18223          NaN
18224         DISK
18225    FORMATION
18226    FORMATION
18227     TRIANGLE
18228        LIGHT
18229         DISK
18230         OVAL
18231         OVAL
18232          NaN
18233      VARIOUS
18234     TRIANGLE
18235          NaN
18236     TRIANGLE
18237         DISK
18238          NaN
18239        LIGHT
18240         OVAL
Name: Shape Reported, Length: 18241, dtype: object

In [45]:
ufo.head

<bound method NDFrame.head of                        City Colors Reported Shape Reported State  \
0                    Ithaca             NaN       TRIANGLE    NY
1               Willingboro             NaN          OTHER    NJ
2                   Holyoke             NaN           OVAL    CO
3                   Abilene             NaN           DISK    KS
4      New York Worlds Fair             NaN          LIGHT    NY
5               Valley City             NaN           DISK    ND
6               Crater Lake             NaN         CIRCLE    CA
7                      Alma             NaN           DISK    MI
8                   Eklutna             NaN          CIGAR    AK
9                   Hubbard             NaN       CYLINDER    OR
10                  Fontana             NaN          LIGHT    CA
11                 Waterloo             NaN       FIREBALL    AL
12                   Belton             RED         SPHERE    SC
13                   Keokuk             NaN           OVAL    IA
14                Ludington             NaN           DISK    MI
15              Forest Home             NaN         CIRCLE    CA
16              Los Angeles             NaN            NaN    CA
17                Hapeville             NaN            NaN    GA
18                   Oneida             NaN      RECTANGLE    TN
19               Bering Sea             RED          OTHER    AK
20                 Nebraska             NaN           DISK    NE
21                      NaN             NaN            NaN    LA
22                      NaN             NaN          LIGHT    LA
23                Owensboro             NaN      RECTANGLE    KY
24               Wilderness             NaN           DISK    WV
25                San Diego             NaN          CIGAR    CA
26               Wilderness             NaN           DISK    WV
27                   Clovis             NaN           DISK    NM
28               Los Alamos             NaN           DISK    NM
29             Ft. Duschene             NaN           DISK    UT
...                     ...             ...            ...   ...
18211               Holyoke             NaN        DIAMOND    MA
18212                Carson             NaN           DISK    CA
18213              Pasadena           GREEN       FIREBALL    CA
18214                Austin             NaN      FORMATION    TX
18215              El Campo             NaN          OTHER    TX
18216          Garden Grove          ORANGE          LIGHT    CA
18217         Berthoud Pass             NaN       TRIANGLE    CO
18218            Sisterdale             NaN        DIAMOND    TX
18219          Garden Grove             NaN        CHEVRON    CA
18220           Shasta Lake            BLUE           DISK    CA
18221              Franklin             NaN           DISK    NH
18222        Albrightsville             NaN          OTHER    PA
18223            Greenville             NaN            NaN    SC
18224               Eufaula             NaN           DISK    OK
18225           Simi Valley             NaN      FORMATION    CA
18226         San Francisco             NaN      FORMATION    CA
18227         San Francisco             NaN       TRIANGLE    CA
18228            Kingsville             NaN          LIGHT    TX
18229               Chicago             NaN           DISK    IL
18230           Pismo Beach             NaN           OVAL    CA
18231           Pismo Beach             NaN           OVAL    CA
18232                  Lodi             NaN            NaN    WI
18233             Anchorage             RED        VARIOUS    AK
18234              Capitola             NaN       TRIANGLE    CA
18235        Fountain Hills             NaN            NaN    AZ
18236            Grant Park             NaN       TRIANGLE    IL
18237           Spirit Lake             NaN           DISK    IA
18238           Eagle River             NaN            NaN    WI
18239           Eagle River             RED          LIGHT    WI
18240                  Ybor             NaN           OVAL    FL

                   Time                  Location
0        6/1/1930 22:00                Ithaca, NY
1       6/30/1930 20:00           Willingboro, NJ
2       2/15/1931 14:00               Holyoke, CO
3        6/1/1931 13:00               Abilene, KS
4       4/18/1933 19:00  New York Worlds Fair, NY
5       9/15/1934 15:30           Valley City, ND
6        6/15/1935 0:00           Crater Lake, CA
7        7/15/1936 0:00                  Alma, MI
8      10/15/1936 17:00               Eklutna, AK
9        6/15/1937 0:00               Hubbard, OR
10      8/15/1937 21:00               Fontana, CA
11       6/1/1939 20:00              Waterloo, AL
12      6/30/1939 20:00                Belton, SC
13        7/7/1939 2:00                Keokuk, IA
14       6/1/1941 13:00             Ludington, MI
15       7/2/1941 11:30           Forest Home, CA
16       2/25/1942 0:00           Los Angeles, CA
17       6/1/1942 22:30             Hapeville, GA
18       7/15/1942 1:00                Oneida, TN
19      4/30/1943 23:00            Bering Sea, AK
20       6/1/1943 15:00              Nebraska, NE
21       8/15/1943 0:00                       NaN
22       8/15/1943 0:00                       NaN
23     10/15/1943 11:00             Owensboro, KY
24       1/1/1944 10:00            Wilderness, WV
25       1/1/1944 12:00             San Diego, CA
26       1/1/1944 12:00            Wilderness, WV
27       4/2/1944 11:00                Clovis, NM
28       6/1/1944 12:00            Los Alamos, NM
29      6/30/1944 10:00          Ft. Duschene, UT
...                 ...                       ...
18211  12/28/2000 18:00               Holyoke, MA
18212  12/28/2000 18:20                Carson, CA
18213  12/28/2000 19:10              Pasadena, CA
18214   12/29/2000 0:00                Austin, TX
18215   12/29/2000 9:00              El Campo, TX
18216  12/29/2000 16:10          Garden Grove, CA
18217  12/29/2000 19:30         Berthoud Pass, CO
18218  12/29/2000 20:00            Sisterdale, TX
18219  12/29/2000 20:30          Garden Grove, CA
18220  12/29/2000 20:30           Shasta Lake, CA
18221  12/29/2000 20:50              Franklin, NH
18222  12/29/2000 21:00        Albrightsville, PA
18223  12/29/2000 22:00            Greenville, SC
18224  12/29/2000 23:30               Eufaula, OK
18225  12/30/2000 10:00           Simi Valley, CA
18226  12/30/2000 22:00         San Francisco, CA
18227  12/30/2000 22:00         San Francisco, CA
18228   12/31/2000 4:00            Kingsville, TX
18229  12/31/2000 11:45               Chicago, IL
18230  12/31/2000 20:00           Pismo Beach, CA
18231  12/31/2000 20:00           Pismo Beach, CA
18232  12/31/2000 20:30                  Lodi, WI
18233  12/31/2000 21:00             Anchorage, AK
18234  12/31/2000 22:00              Capitola, CA
18235  12/31/2000 23:00        Fountain Hills, AZ
18236  12/31/2000 23:00            Grant Park, IL
18237  12/31/2000 23:00           Spirit Lake, IA
18238  12/31/2000 23:45           Eagle River, WI
18239  12/31/2000 23:45           Eagle River, WI
18240  12/31/2000 23:59                  Ybor, FL

[18241 rows x 6 columns]>

<h4>lecture 4 </h4>

In [53]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [54]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [58]:
movies.shape #979 Rows 6col

(979, 6)

In [57]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object